{
    "Основы IT и программирования": [
        {
            "term": "API",
            "definition": "API (Application Programming Interface) — это интерфейс программирования приложений, набор правил и инструментов для создания программного обеспечения."
        },
        {
            "term": "CSS",
            "definition": "CSS (Cascading Style Sheets) — это язык стилевого оформления для документов HTML и XML."
        },
        {
            "term": "JavaScript",
            "definition": "JavaScript — это язык программирования, используемый для создания интерактивных элементов на веб-страницах."
        },
        {
            "term": "HTML",
            "definition": "HTML (HyperText Markup Language) — это стандартный язык разметки для создания веб-страниц."
        },
        {
            "term": "Node.js",
            "definition": "Node.js — это серверная платформа для разработки масштабируемых сетевых приложений, использующая JavaScript."
        }
    ],
    "Цифровая коммуникация": [
        {
            "term": "URL",
            "definition": "URL (Uniform Resource Locator) — это универсальный указатель ресурса, который служит для доступа к данным в интернете."
        },
        {
            "term": "SEO",
            "definition": "SEO (Search Engine Optimization) — это оптимизация веб-сайта для поисковых систем."
        },
        {
            "term": "HTTP",
            "definition": "HTTP (Hypertext Transfer Protocol) — это протокол передачи гипертекста, который используется для передачи данных в интернете."
        },
        {
            "term": "HTTPS",
            "definition": "HTTPS (HyperText Transfer Protocol Secure) — это защищенная версия HTTP, использующая шифрование для защиты данных."
        },
        {
            "term": "IP-адрес",
            "definition": "IP-адрес (Internet Protocol address) — это уникальный идентификатор устройства в сети Интернет."
        }
    ],
    "Цифровая культура и интернет-сленг": [
        {
            "term": "Meme",
            "definition": "Meme — это культурный элемент, который распространяется через интернет в виде изображений или видео с часто изменяющимися подписью."
        },
        {
            "term": "Emoji",
            "definition": "Emoji — это пиктограммы, используемые для выражения эмоций в онлайн-общении."
        },
        {
            "term": "Vlog",
            "definition": "Vlog — это видеоблог, который представляет собой видеоформу записи событий или мнений."
        },
        {
            "term": "GIF",
            "definition": "GIF (Graphics Interchange Format) — это формат изображений, поддерживающий анимацию."
        },
        {
            "term": "Troll",
            "definition": "Troll — это человек, который создает или разжигает конфликты в интернете, часто с целью развлечения."
        }
    ],
    "Технологии и инструменты разработки": [
        {
            "term": "Git",
            "definition": "Git — это распределенная система управления версиями, используемая для отслеживания изменений в коде."
        },
        {
            "term": "Docker",
            "definition": "Docker — это платформа для создания, развертывания и запуска приложений в контейнерах."
        },
        {
            "term": "Kubernetes",
            "definition": "Kubernetes — это система для автоматизации развертывания, масштабирования и управления контейнеризованными приложениями."
        },
        {
            "term": "Python",
            "definition": "Python — это высокоуровневый язык программирования, известный своей простотой и читаемостью."
        },
        {
            "term": "React",
            "definition": "React — это библиотека для разработки пользовательских интерфейсов, используемая для создания одностраничных приложений."
        }
    ]
}
